#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
github_membership.users["wigman"]: Refreshing state... [id=Mage-OS:wigman]
github_membership.users["damienwebdev"]: Refreshing state... [id=Mage-OS:damienwebdev]
github_repository.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=mirror-module-configurable-sample-data-venia]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_membership.users["Vinai"]: Refreshing state... [id=Mage-OS:Vinai]
github_team.teams["infrastructure"]: Refreshing state... [id=6847100]
github_membership.users["johnhughes1984"]: Refreshing state... [id=Mage-OS:johnhughes1984]
github_membership.users["mage-os-ci"]: Refreshing state... [id=Mage-OS:mage-os-ci]
github_membership.users["sprankhub"]: Refreshing state... [id=Mage-OS:sprankhub]
github_team.teams["tech-lead"]: Refreshing state... [id=6847098]
github_team.teams["content"]: Refreshing state... [id=6847102]
github_team.teams["continuous-integration"]: Refreshing state... [id=6847099]
github_team.teams["distribution"]: Refreshing state... [id=6847101]
github_repository.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=mirror-commerce-data-export]
github_repository.mirrors["mirror-magento2"]: Refreshing state... [id=mirror-magento2]
github_repository.mirrors["mirror-page-builder-types"]: Refreshing state... [id=mirror-page-builder-types]
github_repository.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=mirror-adobe-stock-integration]
github_repository.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=mirror-magento-composer-installer]
github_repository.mirrors["mirror-zf1"]: Refreshing state... [id=mirror-zf1]
github_repository.mirrors["mirror-security-package"]: Refreshing state... [id=mirror-security-package]
github_repository.mirrors["mirror-devdocs"]: Refreshing state... [id=mirror-devdocs]
github_repository.mirrors["mirror-inventory"]: Refreshing state... [id=mirror-inventory]
github_repository.mirrors["mirror-composer"]: Refreshing state... [id=mirror-composer]
github_repository.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=mirror-magento2-sample-data]
github_repository.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=mirror-composer-root-update-plugin]
github_repository.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mirror-composer-dependency-version-audit-plugin]
github_repository.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=mirror-magento2-page-builder]
github_repository.mirrors["mirror-adobe-ims"]: Refreshing state... [id=mirror-adobe-ims]
github_repository.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=mirror-inventory-composer-installer]
github_repository.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration]
github_repository.repositories["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export]
github_repository.repositories["mageos-inventory"]: Refreshing state... [id=mageos-inventory]
github_repository.repositories["mageos-magento2"]: Refreshing state... [id=mageos-magento2]
github_repository.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin]
github_repository.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder]
github_repository.repositories["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js]
github_repository.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer]
github_repository.repositories["mage-os-website"]: Refreshing state... [id=mage-os-website]
github_repository.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin]
github_repository.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer]
github_repository.repositories["namespace"]: Refreshing state... [id=namespace]
github_repository.repositories["terraform"]: Refreshing state... [id=terraform]
github_repository.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data]
github_repository.repositories["mageos-security-package"]: Refreshing state... [id=mageos-security-package]
github_team_membership.members["Vinai_content"]: Refreshing state... [id=6847102:Vinai]
github_team_membership.members["sprankhub_distribution"]: Refreshing state... [id=6847101:sprankhub]
github_team_membership.members["Vinai_tech-lead"]: Refreshing state... [id=6847098:Vinai]
github_team_membership.members["Vinai_distribution"]: Refreshing state... [id=6847101:Vinai]
github_team_membership.members["Vinai_infrastructure"]: Refreshing state... [id=6847100:Vinai]
github_team_membership.members["johnhughes1984_content"]: Refreshing state... [id=6847102:johnhughes1984]
github_team_membership.members["sprankhub_infrastructure"]: Refreshing state... [id=6847100:sprankhub]
github_team_membership.members["mage-os-ci_continuous-integration"]: Refreshing state... [id=6847099:mage-os-ci]
github_team_membership.members["wigman_content"]: Refreshing state... [id=6847102:wigman]
github_team_membership.members["damienwebdev_infrastructure"]: Refreshing state... [id=6847100:damienwebdev]
github_branch_protection.mirrors["mirror-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOG3Ro_84By-dJ]
github_branch_protection.mirrors["mirror-inventory"]: Refreshing state... [id=BPR_kwDOGMKBz84By-dN]
github_branch_protection.mirrors["mirror-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOGMKCJ84By-dW]
github_branch_protection.mirrors["mirror-devdocs"]: Refreshing state... [id=BPR_kwDOGwaLE84By-dS]
github_branch_protection.mirrors["mirror-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOG1y7C84By-d5]
github_branch_protection.mirrors["mirror-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOG8L6gs4By-eB]
github_branch_protection.mirrors["mirror-page-builder-types"]: Refreshing state... [id=BPR_kwDOGMKFF84By-dc]
github_branch_protection.mirrors["mirror-module-configurable-sample-data-venia"]: Refreshing state... [id=BPR_kwDOG3Rr984By-dH]
github_branch_protection.mirrors["mirror-zf1"]: Refreshing state... [id=BPR_kwDOGMKC6M4By-d2]
github_branch_protection.mirrors["mirror-adobe-ims"]: Refreshing state... [id=BPR_kwDOG8FV-s4By-dL]
github_branch_protection.mirrors["mirror-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOG1y6y84By-df]
github_branch_protection.mirrors["mirror-magento2"]: Refreshing state... [id=BPR_kwDOGHBHCc4By-d4]
github_branch_protection.mirrors["mirror-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOG8FefM4By-dZ]
github_branch_protection.mirrors["mirror-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOGMKAG84By-dP]
github_branch_protection.mirrors["mirror-composer"]: Refreshing state... [id=BPR_kwDOHynKTc4By-d9]
github_branch_protection.mirrors["mirror-commerce-data-export"]: Refreshing state... [id=BPR_kwDOIIQUpM4By-eH]
github_branch_protection.mirrors["mirror-security-package"]: Refreshing state... [id=BPR_kwDOGMKCY84By-d1]
github_team_repository.teams["mageos-commerce-data-export_distribution"]: Refreshing state... [id=6847101:mageos-commerce-data-export]
github_team_repository.teams["namespace_infrastructure"]: Refreshing state... [id=6847100:namespace]
github_team_repository.teams["generate-mirror-repo-js_infrastructure"]: Refreshing state... [id=6847100:generate-mirror-repo-js]
github_team_repository.teams["mageos-magento2-page-builder_distribution"]: Refreshing state... [id=6847101:mageos-magento2-page-builder]
github_team_repository.teams["mageos-security-package_distribution"]: Refreshing state... [id=6847101:mageos-security-package]
github_team_repository.teams["mageos-composer-root-update-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-root-update-plugin]
github_team_repository.teams["mage-os-website_content"]: Refreshing state... [id=6847102:mage-os-website]
github_team_repository.teams["mageos-magento2_distribution"]: Refreshing state... [id=6847101:mageos-magento2]
github_team_repository.teams["infrastructure_infrastructure"]: Refreshing state... [id=6847100:infrastructure]
github_team_repository.teams["mageos-inventory_distribution"]: Refreshing state... [id=6847101:mageos-inventory]
github_team_repository.teams["mageos-magento-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-magento-composer-installer]
github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"]: Refreshing state... [id=6847101:mageos-composer-dependency-version-audit-plugin]
github_team_repository.teams["mageos-adobe-stock-integration_distribution"]: Refreshing state... [id=6847101:mageos-adobe-stock-integration]
github_team_repository.teams["mageos-inventory-composer-installer_distribution"]: Refreshing state... [id=6847101:mageos-inventory-composer-installer]
github_team_repository.teams["mageos-magento2-sample-data_distribution"]: Refreshing state... [id=6847101:mageos-magento2-sample-data]
github_branch_protection.repositories["generate-mirror-repo-js"]: Refreshing state... [id=BPR_kwDOGta9mM4B0QmJ]
github_branch_protection.repositories["mage-os-website"]: Refreshing state... [id=BPR_kwDOGCTTT84BysLE]
github_branch_protection.repositories["namespace"]: Refreshing state... [id=BPR_kwDOGIl6i84BysLC]
github_branch_protection.repositories["mageos-magento2"]: Refreshing state... [id=BPR_kwDOH66Nbs4BysK-]
github_branch_protection.repositories["infrastructure"]: Refreshing state... [id=BPR_kwDOGHBGY84BysK_]
github_branch_protection.repositories["mageos-inventory"]: Refreshing state... [id=BPR_kwDOIShsYM4BzuWO]
github_branch_protection.repositories["mageos-security-package"]: Refreshing state... [id=BPR_kwDOIShpTM4BzuWV]
github_branch_protection.repositories["mageos-adobe-stock-integration"]: Refreshing state... [id=BPR_kwDOISiZ3M4BzuWZ]
github_branch_protection.repositories["mageos-magento-composer-installer"]: Refreshing state... [id=BPR_kwDOISihV84BzuWa]
github_branch_protection.repositories["mageos-magento2-page-builder"]: Refreshing state... [id=BPR_kwDOISiVZc4BzuWM]
github_branch_protection.repositories["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=BPR_kwDOISiqV84BzuWX]
github_branch_protection.repositories["terraform"]: Refreshing state... [id=BPR_kwDOHNQe7c4BysLD]
github_branch_protection.repositories["mageos-composer-root-update-plugin"]: Refreshing state... [id=BPR_kwDOISimRc4BzuWh]
github_branch_protection.repositories["mageos-inventory-composer-installer"]: Refreshing state... [id=BPR_kwDOISiM084BzuWR]
github_branch_protection.repositories["mageos-magento2-sample-data"]: Refreshing state... [id=BPR_kwDOISivQc4BzuWP]
github_branch_protection.repositories["mageos-commerce-data-export"]: Refreshing state... [id=BPR_kwDOISixH84BzuWN]
github_team_repository.tech-lead["infrastructure"]: Refreshing state... [id=6847098:infrastructure]
github_team_repository.tech-lead["mageos-magento-composer-installer"]: Refreshing state... [id=6847098:mageos-magento-composer-installer]
github_team_repository.tech-lead["mageos-magento2-sample-data"]: Refreshing state... [id=6847098:mageos-magento2-sample-data]
github_repository_file.codeowners["mage-os-website"]: Refreshing state... [id=mage-os-website/CODEOWNERS]
github_team_repository.tech-lead["mageos-security-package"]: Refreshing state... [id=6847098:mageos-security-package]
github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=6847098:mageos-composer-dependency-version-audit-plugin]
github_team_repository.tech-lead["namespace"]: Refreshing state... [id=6847098:namespace]
github_team_repository.tech-lead["mage-os-website"]: Refreshing state... [id=6847098:mage-os-website]
github_team_repository.tech-lead["mageos-composer-root-update-plugin"]: Refreshing state... [id=6847098:mageos-composer-root-update-plugin]
github_team_repository.tech-lead["mageos-magento2-page-builder"]: Refreshing state... [id=6847098:mageos-magento2-page-builder]
github_team_repository.tech-lead["mageos-commerce-data-export"]: Refreshing state... [id=6847098:mageos-commerce-data-export]
github_team_repository.tech-lead["generate-mirror-repo-js"]: Refreshing state... [id=6847098:generate-mirror-repo-js]
github_team_repository.tech-lead["mageos-adobe-stock-integration"]: Refreshing state... [id=6847098:mageos-adobe-stock-integration]
github_team_repository.tech-lead["mageos-magento2"]: Refreshing state... [id=6847098:mageos-magento2]
github_team_repository.tech-lead["mageos-inventory-composer-installer"]: Refreshing state... [id=6847098:mageos-inventory-composer-installer]
github_team_repository.tech-lead["mageos-inventory"]: Refreshing state... [id=6847098:mageos-inventory]
github_team_repository.tech-lead["terraform"]: Refreshing state... [id=6847098:terraform]
github_repository_file.codeowners["mageos-magento-composer-installer"]: Refreshing state... [id=mageos-magento-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-sample-data"]: Refreshing state... [id=mageos-magento2-sample-data/CODEOWNERS]
github_repository_file.codeowners["infrastructure"]: Refreshing state... [id=infrastructure/CODEOWNERS]
github_repository_file.codeowners["mageos-security-package"]: Refreshing state... [id=mageos-security-package/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory"]: Refreshing state... [id=mageos-inventory/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2-page-builder"]: Refreshing state... [id=mageos-magento2-page-builder/CODEOWNERS]
github_repository_file.codeowners["namespace"]: Refreshing state... [id=namespace/CODEOWNERS]
github_repository_file.codeowners["terraform"]: Refreshing state... [id=terraform/CODEOWNERS]
github_repository_file.codeowners["generate-mirror-repo-js"]: Refreshing state... [id=generate-mirror-repo-js/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-root-update-plugin"]: Refreshing state... [id=mageos-composer-root-update-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-magento2"]: Refreshing state... [id=mageos-magento2/CODEOWNERS]
github_repository_file.codeowners["mageos-inventory-composer-installer"]: Refreshing state... [id=mageos-inventory-composer-installer/CODEOWNERS]
github_repository_file.codeowners["mageos-composer-dependency-version-audit-plugin"]: Refreshing state... [id=mageos-composer-dependency-version-audit-plugin/CODEOWNERS]
github_repository_file.codeowners["mageos-commerce-data-export"]: Refreshing state... [id=mageos-commerce-data-export/CODEOWNERS]
github_repository_file.codeowners["mageos-adobe-stock-integration"]: Refreshing state... [id=mageos-adobe-stock-integration/CODEOWNERS]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_branch_protection.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_branch_protection" "repositories" {
        id                              = "BPR_kwDOGta9mM4B0QmJ"
      + push_restrictions               = []
        # (8 unchanged attributes hidden)


      ~ required_status_checks {
          + contexts = []
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }

  # github_membership.users["Vinai"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"79735074d8acdd8e7c91e4da760308c7a0b8987a4a5347a614af13acea8dbb7d\"" -> "W/\"21a8ba444eced1365dca35f094928b5c1d4ea366d8dd72e25fee5ecdbe430a4e\""
        id       = "Mage-OS:Vinai"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["damienwebdev"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"c990dd646b7979b399e2f04d6fbc058b9605946360cc2e1b8f9d319f996fc93d\"" -> "W/\"8f4a1a73856ea2620be9eeee5736930ab5486b3222b001d24697961588f5a795\""
        id       = "Mage-OS:damienwebdev"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["johnhughes1984"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"34b66594ad059b9d4e5775a54b7ee8aa3d79552fd08893e2b865b1aefd9a58a8\"" -> "W/\"561a58d4da9cade04cfb9405a875d3effad69d76857ea550c53e14eac279c396\""
        id       = "Mage-OS:johnhughes1984"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["mage-os-ci"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"4628a6be1bb33a9d3ff9b531109baa2a9159f3d3ffb1ef25be25c093ad540d81\"" -> "W/\"7f8acfe722f4cc9d47d7c365fba31b05bd38f82fefacf56e11d79ae476473031\""
        id       = "Mage-OS:mage-os-ci"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["sprankhub"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"2ed55076d613edcab5d72f9ae280e5955c24eff246ba71d41b0d6c71e3b6b5da\"" -> "W/\"bb4f6b6e509ee59c31fd50a66f8bee6cd57cae582e32791837325ecec6d47a1d\""
        id       = "Mage-OS:sprankhub"
        # (2 unchanged attributes hidden)
    }

  # github_membership.users["wigman"] has changed
  ~ resource "github_membership" "users" {
      ~ etag     = "W/\"f8d61a095cd053ed2309475b92289861967cedbaa1541d10ca501a88df991c78\"" -> "W/\"b0240fe5c7f89e807f02e4d548840d268dc7be3d924c2097675312090ba8b8a0\""
        id       = "Mage-OS:wigman"
        # (2 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-commerce-data-export"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ branches               = [
          ~ {
              ~ protected = false -> true
                # (1 unchanged element hidden)
            },
        ]
      ~ etag                   = "W/\"6f4ff8e8709ad0ee3861b59bad3b4e80037ce94c79a2c37d54389c3b91f2c4ad\"" -> "W/\"a23116fad0df33cb6b8678286f09c17e2f1f2ac533f028ddfb20b1254e1ee62a\""
        id                     = "mirror-commerce-data-export"
        name                   = "mirror-commerce-data-export"
        # (26 unchanged attributes hidden)
    }

  # github_repository.mirrors["mirror-magento2"] has changed
  ~ resource "github_repository" "mirrors" {
      ~ etag                   = "W/\"035f30ca501a2c036f534c0acc5daf2eed2ff4011ce829b3a77c5ea7c54cfdf9\"" -> "W/\"4dbf6e748ad850ed4272a890151c15e95209fcd275f3614ec2b38359f63f38e2\""
        id                     = "mirror-magento2"
        name                   = "mirror-magento2"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repositories["generate-mirror-repo-js"] has changed
  ~ resource "github_repository" "repositories" {
      ~ branches               = [
            {
                name      = "23/nightly-integration-test"
                protected = false
            },
          ~ {
              ~ name      = "add-danslo-integrity-check-action" -> "add_mageos_nightly"
              ~ protected = false -> true
            },
          ~ {
              ~ name      = "integrity-complete" -> "add-danslo-integrity-check-action"
              ~ protected = false -> true
            },
          ~ {
              ~ name      = "main" -> "integrity-complete"
              ~ protected = false -> true
            },
          ~ {
              ~ name      = "nightly_builds_ci" -> "main"
              ~ protected = false -> true
            },
          + {
              + name      = "nightly_builds_ci"
              + protected = true
            },
        ]
      ~ description            = "Experimental JavaScript monorepo splitter implementation." -> "Mage-OS packaging implementation (JavaScript)"
      ~ etag                   = "W/\"4cb2a4f7dfa10156439f46170acea41ba9251cd05407db2f7bb96614bbe5f96f\"" -> "W/\"eb2ab3f21c64c335ad8b229efc4093fb0cd7d7d86bcf3081e2822a0782f04d1d\""
        id                     = "generate-mirror-repo-js"
        name                   = "generate-mirror-repo-js"
        # (25 unchanged attributes hidden)
    }

  # github_repository.repositories["mage-os-website"] has changed
  ~ resource "github_repository" "repositories" {
      ~ branches               = [
          + {
              + name      = "2022-11-02-update"
              + protected = true
            },
          + {
              + name      = "faq"
              + protected = true
            },
            {
                name      = "main"
                protected = true
            },
            # (1 unchanged element hidden)
        ]
      ~ etag                   = "W/\"f7b4310c83fc75e13d6f326f722260b30dad93ce5700bd038d09c878d71d065b\"" -> "W/\"9b2efcbaefa99d864900330b0987b08c3d784ae5f900634289b967a066c20244\""
      + homepage_url           = "mage-os-community.vercel.app"
        id                     = "mage-os-website"
        name                   = "mage-os-website"
        # (26 unchanged attributes hidden)
    }

  # github_repository.repositories["mageos-magento2"] has changed
  ~ resource "github_repository" "repositories" {
      ~ etag                   = "W/\"68e0d2cb8ede00673d5d59d09252287c51c2a11de5b411d50c5464365eda9883\"" -> "W/\"b7c5029e447dc7abbb433008d63c2822bdc5b0a55295c81502aa96e6d0593557\""
        id                     = "mageos-magento2"
        name                   = "mageos-magento2"
        # (27 unchanged attributes hidden)
    }

  # github_team.teams["content"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"7b9a1433f2ad177641496c40aab3a74fabb78b0646367120b0830125708b929e\"" -> "W/\"71f7c9d494d5bec09c27e68fa956ba10d058c24801e7bcd4ac14ac94019c6ba4\""
        id                        = "6847102"
        name                      = "content"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["continuous-integration"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"f49878299e96c25032f784c8bc2a62088eda38dc0bdc9c77f1a8cc407c729ed6\"" -> "W/\"45b7968a81dd2631a3248327917b961fe390329c3c19ddb03732f3c1fe6bacf8\""
        id                        = "6847099"
        name                      = "continuous-integration"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["distribution"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"772369a7ebfb5aa7535c0dc8efbc1f708a61c5590b1ad28037fbe9d93ecd306b\"" -> "W/\"fea95199bc03bfb4e4f15e88bdffb671c1b18016667bce913fdf56015bd085a4\""
        id                        = "6847101"
        name                      = "distribution"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["infrastructure"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"f2e8f23eabd33f3aa4760db7e4c744181596aec22767852d887d2a11cfe6bcb8\"" -> "W/\"d59b1be047e679a086dc1f977662446b631c6b8dd2cf039bd903218f639e1777\""
        id                        = "6847100"
        name                      = "infrastructure"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["tech-lead"] has changed
  ~ resource "github_team" "teams" {
      ~ etag                      = "W/\"e1a5e82f6375518772e4db2d1472b208c95219df886f6874a2313f7c04a3de62\"" -> "W/\"8e2fdca230b6e71aaef3ade4ec2536d815a6d138a37307f7f427921c27a634fa\""
        id                        = "6847098"
        name                      = "tech-lead"
        # (6 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"d14017af5b13f5992577edc0622c856cf9a21708af430317dc20cc23eac21af0\"" -> "W/\"669998fdadaea2405c5e587045e128da7995076ff093b39dee72091699dc926c\""
        id       = "6847102:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"0f537db0aae9b404b21c3d90238145e904b3e38a7e5e98c0b30f5db1c18aaecf\"" -> "W/\"248bf6748f32278a4bcd1b0e7fb88f99feea280efd943cf8f1edc76bff10a4d7\""
        id       = "6847101:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"e33da1a80a73fedb520492ff5cf123e3bbbfeeac1333d31e07b0faf6aeb6ca4e\"" -> "W/\"ed9afdecd61b72dc54a544389decc5d3c46e3b3058dd652d47d5ec0fa87bbc9f\""
        id       = "6847100:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["Vinai_tech-lead"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"324509b8d02e252122cd5e215ff8b417f7bf18867dec592796818efb2a6f35c1\"" -> "W/\"e75ffeef201584f547f9953bdcdb1fb2d1f543dfd7d198420d604b10b6622c5e\""
        id       = "6847098:Vinai"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["damienwebdev_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"7efb7c1e11897934498ee2c42810bab15fd9e1bb87a9120aa92a2208c2bd94d1\"" -> "W/\"ff2488429e92ddd8a9d7ef104354ca9c8eefcf8db230a6f5bc3e671ea880a96f\""
        id       = "6847100:damienwebdev"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["johnhughes1984_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"ab31766b707dbf952854da1f794721fa3f03d84ec7dfc6ed607c734c535dbc8c\"" -> "W/\"9437b103eafee2b3f054a608fa01ea4ad78b14c3b816bc6d795157274f7930dc\""
        id       = "6847102:johnhughes1984"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["mage-os-ci_continuous-integration"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"0f3536c072f4782bc7c30c0a88ac28af041b60a572f021522cd9b88f970bbe03\"" -> "W/\"26f4312ee3375ba9aef85356c372b1524007ac839a2cad8d64d74f776a1cef0a\""
        id       = "6847099:mage-os-ci"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_distribution"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"9716350982ae48393b041e6dc383ee9e04797094ee4c735a2d7f4a81cad7c5c6\"" -> "W/\"a6199b032c9f5b051c6759bff685ea3f168c18bd78e133c81a83a27d13f8d6fb\""
        id       = "6847101:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["sprankhub_infrastructure"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"8207dfc01728f5049c4f70af28c223138136ce98e7c4ac8784e571988a3c5344\"" -> "W/\"47375b382da22787237dde8d6d0efdd6cd9a0ac2cb08506b3f66bbf8111caf6d\""
        id       = "6847100:sprankhub"
        # (3 unchanged attributes hidden)
    }

  # github_team_membership.members["wigman_content"] has changed
  ~ resource "github_team_membership" "members" {
      ~ etag     = "W/\"aa2252f02620b2fcf86c8a8203913b3c7f522e3df3a857cc56c6a520dc79cadd\"" -> "W/\"e4a7dd4b9aab9c42536af37ea8f6fdf72a1e4505ef6b31c945b91998bdcebf64\""
        id       = "6847102:wigman"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["generate-mirror-repo-js_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"4a3d25ff8e703b428dedcdd8049468f6eaa5b118309740bb204ef05cadbc1bf4\"" -> "W/\"afb168f5916a4ad2904911f5dc96d033917accca5c0976df21b0089702e90d13\""
        id         = "6847100:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["infrastructure_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"cf99d6b1c0169ccaebbd54b4c071cd171a594b5aac2d1cc3735b1cfc2146761d\"" -> "W/\"48dbc2307a4f7b75f954d8ffbed63cd1bf83424a9f70637949033f508fbc6229\""
        id         = "6847100:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mage-os-website_content"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"f7e19cb391cf6cdf33ac6dfe0152418db61836afa6dc05ddba04e7a762962b8e\"" -> "W/\"8af361f461eebe6cc44c837a741c92bfed7044bd1aa228c7bbd29e8200c21ed1\""
        id         = "6847102:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-adobe-stock-integration_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"d8077aaf6b4e95492ba849c1ff5207340bd17b5bc32854a373921678515ac871\"" -> "W/\"a3238dd0deb78aa85dbe21fa4e4d5ca254f7b63b6de235a1315098e2e3eb533a\""
        id         = "6847101:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-commerce-data-export_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e672a802f8281852fdbd90eb8b95c655e4108939cc07734fd630d9e78ec43304\"" -> "W/\"eadb45a8d36d7aed2a03069a90ee367f99a6da81683c5f4946359ebefa530a2d\""
        id         = "6847101:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-dependency-version-audit-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"a46c46cc486278c18627b55468c98f286fab58129ed804d967912e65164d66c6\"" -> "W/\"f7bfee49a5624f0428f119992054c1d2f5d184e4eaa74701d8cec0d0c9659349\""
        id         = "6847101:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-composer-root-update-plugin_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"8f3c7056b5a343d587bbcef8ec442aeda57fd81ab16b3f0038c1a49437de80d3\"" -> "W/\"2529df037ee5d56270a058dad06b2f6e15e3f8003e8cf2ee25f704cb42962ed0\""
        id         = "6847101:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"fc233a713e18df79b868344bf7060f0dc2776757346fed27cb589bda9b5b150b\"" -> "W/\"f8fecdd2ff6fec76bc2766e9e0f40b01d4c2ef6cb914c49159af738b4e3e0dd2\""
        id         = "6847101:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-inventory_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"99ac2b43b8dc0bd908743bf92b4b6df78f2b92542cdfe71399ed8a65b7424d92\"" -> "W/\"538decb239ec33705053d9251cc8295e3adda50e359999625ca5b8ea282368ff\""
        id         = "6847101:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento-composer-installer_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"61a7a3cf9acb2ab2d3f051f5f13fec2a5ddd8b3d36a29a5a63e180814b7a5e15\"" -> "W/\"b7e6e13895ca42baf9cb8712c131cb9b99f0e188efac19764521d68fd0891258\""
        id         = "6847101:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-page-builder_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6f2c0398ea24a8fd60e123f014705be81e4105c2dba9e03b66a82550171a2b7e\"" -> "W/\"c1c5bb8cef4170aeef54d75d7af99c9cfeeb49f65c7cd9e007c15f1ef3262146\""
        id         = "6847101:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2-sample-data_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"5110765936fb931bb51d087a6e2a4ecbd495aad7b03ae826a5276b8f53ae4498\"" -> "W/\"bbe5c8e2fec767239c82072d3cf047b075f5cac9f562d92a0f531410a6566640\""
        id         = "6847101:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-magento2_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"e160b42b0ebd8ef5dca28bdc6c512173e3ac94215bec94e76f5df609cb70fd8b\"" -> "W/\"9ecd611f17a6edefa2e619ea80ccf9d6955dac819a3f4f4e2d76fc337c10c11e\""
        id         = "6847101:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["mageos-security-package_distribution"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"4bcfc86736a54be427f206e6a768692668b32fbc79e390415407a60a6fb3f18a\"" -> "W/\"01e99f33bfce28916258210e761aa995c5a585fa1dfaabcd0252e1f958a56df6\""
        id         = "6847101:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.teams["namespace_infrastructure"] has changed
  ~ resource "github_team_repository" "teams" {
      ~ etag       = "W/\"6105e214e3edc72be7cec3a1e85b160557bc1f9f5140b0acfe1a97c6f82d66b9\"" -> "W/\"407a1740f572b2c9ceb8be2e33ce03e2dfaa8b36f02d491e7a8d3e5cd9af5297\""
        id         = "6847100:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["generate-mirror-repo-js"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"de78c1d248e873accdf92e4005376319bfbdf698f207968cf5c2c5a18fcb7904\"" -> "W/\"615c2f6aa8e675a62d187115bd80adc02a96604185bd80995d9772cccd1c7938\""
        id         = "6847098:generate-mirror-repo-js"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["infrastructure"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"6664c3b8d75e8fd0519fe0b218ba31a4b577505e8931105149ffab1502c9e29d\"" -> "W/\"532ecbc6f63bfd38601f78870bb07e8f21fc6a9dcee8a361b86699eb8197ddd3\""
        id         = "6847098:infrastructure"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mage-os-website"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"8f8e0be45b126a117f3661eb0352865b1655a20da5736647f75466b5f6e08008\"" -> "W/\"fad99003a6d82af7649c576dc651813d14abb22530bd6cd508768cba701fc9fe\""
        id         = "6847098:mage-os-website"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-adobe-stock-integration"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"74f56a4c9c07a40722e5cafa1acd651eec072b20af57b5f4a9160a82e7555395\"" -> "W/\"68ba091810418239d10e4355a52893801e0a80525793f906d5b9e8e8efe0faf7\""
        id         = "6847098:mageos-adobe-stock-integration"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-commerce-data-export"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"266c4599ca7055ffd3f94b457361c914390d1dd920d9b413033dd70cd6dc0549\"" -> "W/\"afe9d533a298cdb5021216c41f71396364fdd551aa9dd266e5c6925d656a68e7\""
        id         = "6847098:mageos-commerce-data-export"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-dependency-version-audit-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"040651f269950f07f437804e50b1580fc29c3cf4147c888c5a8af95fbb0f9e31\"" -> "W/\"32f370b3f9c8d412d2392fa9a66b520676de75927a42add86b20ce01db5c8da4\""
        id         = "6847098:mageos-composer-dependency-version-audit-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-composer-root-update-plugin"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"215f42455280915f3d5cfdec3077f4d2f4916d9b275cd6739c1e8dc2e0c9186f\"" -> "W/\"e73b6e277e4faf66c5a4ecb64901d938f55717a0313ced96c07aea2760f0a639\""
        id         = "6847098:mageos-composer-root-update-plugin"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"3a50c808c59a82ca84f4b27b6ad648803ee17e414ea418c5f44536f0cef8a0c0\"" -> "W/\"bfbf6184e9cbb0189c13d8380e5291c7b565cf50cfbb38732ec4aaf294090b50\""
        id         = "6847098:mageos-inventory"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-inventory-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0e63887de46c5775e411c2e08e16feaab8ad27d603c865d0f32aa5931428432c\"" -> "W/\"a25453fa0e5a6e9bd8540c437493935afb69a4d050fa63230097d5e12d994839\""
        id         = "6847098:mageos-inventory-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento-composer-installer"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"957669fa955af81db20602cb18b05772a60ce906443a00de6acfd51b93689486\"" -> "W/\"88ef40496252d2f1a332b97d24ad4c2471b44035f14f0f717fb0ab8dd2be391a\""
        id         = "6847098:mageos-magento-composer-installer"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"0b1b55a016bcb9c5b7655cae7f44af764b74779a8a263be91517fc0c1f8d2a05\"" -> "W/\"1e8ab31c2237be3a9e08258db92c925666f311e3f0dc8f7acec8dcaf8e3b7b72\""
        id         = "6847098:mageos-magento2"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-page-builder"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"310ede0235ab3fef77df9adb460c6aa39963cd68d3e241de636c43a26fd73146\"" -> "W/\"c944534f73ac19bff48c800c18707e89876c63849cb0bb2e747677754ed0503b\""
        id         = "6847098:mageos-magento2-page-builder"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-magento2-sample-data"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"4fb592c494d55625ec771256c3bf0bbaf99ff2e825767560bfc3a1a89f54534d\"" -> "W/\"46210c58a3331c4dd9da6d4cceb18ae6e99e1974873d8b610db64fba50f10a29\""
        id         = "6847098:mageos-magento2-sample-data"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["mageos-security-package"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"f5911dcf6e546f05eb33b79baa864ce386ad8ffa8282243ff496c9404e7828c5\"" -> "W/\"ffa540fff15734028b85a05095aa375ba4528e92ff88bee353a26e8caeafcc7a\""
        id         = "6847098:mageos-security-package"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["namespace"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"683bd5eb5f13c986c044fadd98fe038b08df2405f87c8cf986a16430a28b6719\"" -> "W/\"c8a618c97af344480abf395dbbb64c080b1cf51ab286ba4921656e957a0647f1\""
        id         = "6847098:namespace"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.tech-lead["terraform"] has changed
  ~ resource "github_team_repository" "tech-lead" {
      ~ etag       = "W/\"25cec35e524dccebcd2ea5f5d9de5b6c0d5240b4a56244f001f2f4afbc49c187\"" -> "W/\"c2b24498c6c7b1f2e8cb22db6bfea21283c205ba1f1e2994193e7806bb1e686c\""
        id         = "6847098:terraform"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.mirrors["mirror-commerce-admin.en"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.mirrors["mirror-commerce-operations.en"] will be created
  + resource "github_branch_protection" "mirrors" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + push_restrictions               = [
          + "U_kgDOBfjDkQ",
        ]
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_repository.mirrors["mirror-commerce-admin.en"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror of https://github.com/AdobeDocs/commerce-admin.en."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-commerce-admin.en"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.mirrors["mirror-commerce-operations.en"] will be created
  + resource "github_repository" "mirrors" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "Mage-OS mirror of https://github.com/AdobeDocs/commerce-operations.en."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "mirror-commerce-operations.en"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = (known after apply)
    }

  # github_repository.repositories["generate-mirror-repo-js"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ description            = "Mage-OS packaging implementation (JavaScript)" -> "Experimental JavaScript monorepo splitter implementation."
        id                     = "generate-mirror-repo-js"
        name                   = "generate-mirror-repo-js"
        # (27 unchanged attributes hidden)
    }

  # github_repository.repositories["mage-os-website"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      - homepage_url           = "mage-os-community.vercel.app" -> null
        id                     = "mage-os-website"
        name                   = "mage-os-website"
        # (28 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Issuer: @sprankhub, Action: https://github.com/mage-os/terraform/actions/runs/3409481848